{
    "Aamon": "A stealthy assassin who excels at burst damage and can become invisible, making him a deadly threat to squishy heroes.",
    "Aldous": "A fighter who gains infinite scaling by collecting stacks, becoming extremely powerful in the late game with his one-shot potential.",
    "Alice": "A mage/tank hybrid who can sustain herself through lifesteal while dealing consistent AoE damage.",
    "Alpha": "A fighter with strong poke abilities and chase potential, equipped with a powerful ultimate for team fights.",
    "Alucard": "A fighter/assassin who excels at single-target damage and lifesteal, particularly strong in 1v1 situations.",
    "Angela": "A support hero who can attach to allies, providing healing and enhanced damage while being untargetable.",
    "Argus": "A fighter with an ultimate that grants immortality, making him a terrifying duelist when properly timed.",
    "Atlas": "A tank with powerful crowd control abilities, specializing in setting up team fights with his ultimate.",
    "Aulus": "A fighter who becomes stronger as he levels up, with his ultimate granting enhanced basic attacks.",
    "Aurora": "A mage with strong crowd control abilities, capable of freezing enemies and dealing burst damage.",
    "Badang": "A fighter who excels at wall-pinning enemies and dealing continuous damage with his ultimate.",
    "Balmond": "A fighter/tank hybrid who can execute low-health enemies and sustain through fights with his spin ability.",
    "Barats": "A tank who grows in size and power as he stacks his passive, becoming increasingly difficult to take down.",
    "Baxia": "A durable tank hero who excels at disrupting enemy formations with his unique rolling ability and damage reduction capabilities. His shield and control abilities make him particularly effective against burst damage heroes.",
    "Beatrix": "A marksman who can switch between four different weapons, each with unique abilities and playstyles.",
    "Belerick": "A tank who reflects damage to attackers and protects allies with his passive ability.",
    "Benedetta": "An assassin with high mobility and immunity frames, requiring precise timing to master.",
    "Brody": "A marksman who deals high burst damage with his skills and enhanced basic attacks.",
    "Bruno": "A marksman with soccer-themed abilities, known for his critical strikes and ball control.",
    "Carmilla": "A support/tank hybrid who can share damage taken with linked enemies.",
    "Cecilion": "A mage with infinite scaling on his first skill, becoming extremely powerful in late game.",
    "Chang'e": "A mage who excels at poking and wave clearing with her ultimate ability.",
    "Claude": "A highly mobile marksman who uses his monkey companion Dexter to deal continuous damage. His ultimate ability makes him especially effective against grouped enemies.",
    "Chou": "A fighter with high mobility and crowd control, popular for his ability to kick enemies out of position.",
    "Clint": "A marksman with enhanced basic attacks and long-range abilities.",
    "Cyclops": "A mage who can reduce his cooldowns quickly by hitting enemies with his orbiting stars.",
    "Diggie": "A support who can prevent crowd control effects and set up time bombs.",
    "Dyrroth": "A fighter who can weaken enemy defenses and deal true damage.",
    "Edith": "A tank who can transform into a marksman, offering unique versatility in team compositions.",
    "Esmeralda": "A hybrid tank-mage who excels at absorbing and converting shields into HP. Her sustained damage and shield-stealing ability make her particularly strong in extended fights.",
    "Estes": "A support hero specializing in continuous healing and mana regeneration.",
    "Eudora": "A mage with powerful single-target burst damage and reliable stun.",
    "Fanny": "An assassin who uses energy and cables to fly around the map, requiring high mechanical skill.",
    "Faramis": "A support who can revive allies and pull enemies together for team fights.",
    "Floryn": "A support who can heal allies and provide vision across the map.",
    "Franco": "A tank known for his hook ability and single-target crowd control.",
    "Fredrinn": "A fighter who gains power through rage, becoming more dangerous as fights progress.",
    "Freya": "A fighter who excels at jumping into battle and locking down enemies.",
    "Gatotkaca": "A tank with a taunt ability and powerful ultimate for initiating fights.",
    "Gloo": "A tank who can split into smaller forms and attach to enemies.",
    "Gord": "A mage who specializes in continuous beam damage and area control.",
    "Granger": "A marksman with high physical burst damage and mobility.",
    "Grock": "A tank who gains extra defenses near walls and can create terrain.",
    "Guinevere": "A fighter/mage hybrid who can knock up enemies and deal burst damage.",
    "Gusion": "An assassin with high burst damage potential through dagger manipulation.",
    "Hanabi": "A marksman who bounces attacks between enemies and has a shield passive.",
    "Hanzo": "An assassin who can separate from his body to fight safely.",
    "Harith": "A mage with high mobility and shield generation through dashing.",
    "Harley": "A mage/assassin who can teleport and mark targets for extra damage.",
    "Hayabusa": "An assassin who excels at shadow manipulation and single-target elimination.",
    "Helcurt": "An assassin who can silence enemies and create darkness across the map.",
    "Hilda": "A fighter/tank hybrid who gains extra regeneration in bushes.",
    "Hylos": "A tank who can stun enemies and create paths with his ultimate.",
    "Irithel": "A marksman who can attack while moving and ride a lion.",
    "Johnson": "A tank who can transform into a car and crash into enemies.",
    "Joy": "An assassin with unique transformation abilities and high mobility.",
    "Julian": "A fighter with combo-based abilities that enhance each other.",
    "Kadita": "A mage with high burst damage and immunity frames during skills.",
    "Kagura": "A mage who manipulates an umbrella for damage and mobility.",
    "Kaja": "A support/fighter who can suppress enemies and pull them out of position.",
    "Karina": "An assassin who excels at executing low-health targets.",
    "Karrie": "A marksman specializing in true damage output. Her passive ability makes her extremely effective against high HP heroes, making her a natural tank counter.",
    "Khaleed": "A fighter who gains sustain through his skills and can chase enemies.",
    "Khufra": "A tank who can counter mobility skills and bounce on enemies.",
    "Kimmy": "A marksman/mage hybrid who can move while attacking in any direction.",
    "Lancelot": "An assassin with high mobility and immunity frames during skills.",
    "Lapu-Lapu": "A fighter who transforms with his ultimate, gaining enhanced abilities.",
    "Layla": "A marksman with long range and increasing damage based on distance.",
    "Leomord": "A fighter who becomes stronger when mounted on his horse.",
    "Lesley": "A marksman who specializes in critical strikes and stealth.",
    "Ling": "An assassin who can walk on walls and drop down on enemies.",
    "Lolita": "A tank who can block projectiles and stun enemies in an area.",
    "Lou Yi": "A mage who manipulates yin-yang orbs for damage and control.",
    "Lunox": "A mage who can switch between light and dark powers.",
    "Lylia": "A mage who can rewind time and create explosive shadow puppets.",
    "Martis": "A fighter with strong crowd control and execution abilities.",
    "Masha": "A fighter who excels at taking objectives and has multiple health bars.",
    "Mathilda": "A support/assassin who can dash with allies and provide shields.",
    "Melissa": "A marksman who controls a puppet to enhance her attacks.",
    "Minotaur": "A tank who becomes stronger when enraged, providing AoE crowd control.",
    "Minsitthar": "A fighter who can hook enemies and prevent them from using blink skills.",
    "Miya": "A marksman with high attack speed and a stealth ultimate.",
    "Moskov": "A marksman who can pierce through enemies and pin them to walls.",
    "Nana": "A mage/support who can transform enemies into cats and place traps.",
    "Natalia": "An assassin who excels at stealth and silencing enemies.",
    "Natan": "A marksman who manipulates time and can clone himself.",
    "Novaria": "A mage who controls cosmic forces and can manipulate space.",
    "Odette": "A mage with powerful area damage and crowd control abilities.",
    "Paquito": "A fighter who chains skills together for enhanced effects.",
    "Pharsa": "A mage who can fly and rain down damage from above.",
    "Phoveus": "A fighter who counters enemy dash abilities with his ultimate.",
    "Popol and Kupa": "A marksman duo with a wolf companion for extra damage and control.",
    "Rafaela": "A support who provides healing and movement speed to allies.",
    "Roger": "A marksman/fighter who can transform between human and wolf form.",
    "Ruby": "A fighter with high lifesteal and crowd control abilities.",
    "Rynn": "A marksman with enhanced mobility and trap-setting abilities.",
    "Saber": "An assassin who specializes in single-target elimination.",
    "Selena": "An assassin/mage hybrid who can switch forms and set traps.",
    "Silvanna": "A fighter who can lock down enemies in a zone and deal continuous damage.",
    "Sun": "A fighter who creates clones to overwhelm enemies.",
    "Terizla": "A fighter with heavy crowd control and area damage abilities.",
    "Thamuz": "A fighter who excels at sustained damage and life drain.",
    "Tigreal": "A tank with powerful crowd control abilities for team fights.",
    "Uranus": "A tank with high regeneration and continuous damage.",
    "Vale": "A mage with customizable skills and high burst damage.",
    "Valentina": "A mage who can copy enemy ultimates and adapt to any situation.",
    "Valir": "A mage who controls fire and can knock back enemies.",
    "Vexana": "A mage who can create puppets of enemy heroes.",
    "Wanwan": "A marksman who can become invulnerable during her ultimate.",
    "X.Borg": "A fighter who deals true damage and has a second life through his armor.",
    "Xavier": "A mage with global presence and penetrating abilities.",
    "Yi Sun-Shin": "A marksman/assassin hybrid with global presence and versatile skills.",
    "Yin": "A fighter who can isolate enemies in his domain.",
    "Yu Zhong": "A fighter who transforms into a dragon and sustains through fights.",
    "Yve": "A mage who controls an area with her skills and ultimate.",
    "Zhask": "A mage who spawns a destructive alien to fight for him."
} 